游戏={

    "钩子":[
            {
                "所有者":"id", # 这个所有者是用来区分是否活着的. id是字符串
                "身份":...,
                "优先":...,
                "操作":...,
                "完整":...
            },
        ],

    "选择器场地":{ # 有顺序的id
        "我方前场":[],
        "我方后场":[],
        "敌方前场":[],
        "敌方后场":[]
    },

    "进程场地":{
        "我方":[
            {"身份":...,"活着":True},
        ],
        "敌方":[
            {"身份":...,"活着":True},
        ],
        "系统":[
            {"身份":...,"活着":True},
        ]
    },

    "未加载敌人":[
        {"最大敌人量":5,"激活":True,"内容":["名称",]},
    ],

    "横向行动条":[
        {"性质":...,},
    ],

    "纵向行动条":[
        {"身份":...,"剩余路程":...,"行动值":...},
    ],

    "身份表":{
        "id":...,
        "id2":...,
    }

}

# ==== 角色文件开始 ====

class 钩子1:
    身份="钩子1"
    优先=0

    def 主要(本钩子,游戏,元行动):
        ...

class 主要:
    身份="待定"
    名称="角色名称"

    基础属性={
        "生命":100,
    }

    当前面板={
        "生命":100,
    }

    钩子列表=[钩子1]

# ==== 角色文件结束 ====