游戏={

    "钩子":[
            {
                "所有者":"id",
                "名称":...,
                "优先":...,
                "操作":...,
                "完整":...
            },
        ],

    "我方场地":[],
    "敌方场地":[],

    "进程场地":{
        "我方":[
            {"身份":...},
        ],
        "敌方":[
            {"身份":...},
        ],
        "系统":[
            {"身份":...},
        ]
    },

    "未加载敌人":[
        {"最大敌人量":5,"内容":["名称",]},
    ],

    "横向行动条":[
        {"性质":...,"身份":...,"所有者":...,"所属":...,# 必要的
        },
    ],

    "纵向行动条":[
        {"身份":...,"剩余路程":...,"行动值":...},
    ],

    "身份表":{
        "id":...,
        "id2":...,
    }

}

# ==== 角色文件开始 ====

class 钩子1:
    名称="钩子1"
    优先=0

    def 主要(本钩子,游戏,元行动):
        ...

class 主要:
    身份="0"
    名称="角色名称"
    性质="我方单位"
    当前生命=...
    能量上限=...
    当前能量=...

    面板={
        "当前":{
            "速度":...,
        },
        "基础":{
            "速度":...,
        }
    }

    钩子列表=[钩子1]

# ==== 角色文件结束 ====

{"性质":"选择器","身份":...,"所有者":...,"所属":...,
 "阻塞式":True,"可选项":[],"终选项":-1,"补充数据":{},"当前行动体":...}# 选择器元行动
{"性质":"伤害","身份":...,"所有者":...,"所属":...,
 "标签":[],"乘区":{"增伤":...,"穿防":...,},
 "主值":[
     {"驱动者":...,"驱动区":"攻击力","倍率":...},
     {"驱动者":...,"驱动区":"1","倍率":...},
     ],
 "伤害":...,"目标身份":...}
{"性质":"单位亡语","身份":...,"所有者":...,"所属":...,
 "成功性":True}
{"性质":"能量恢复","身份":...,"所有者":...,"所属":...,
 "能量恢复量":...,"充能效率":...}

# 还是拆得太粗了....
# 攻击之下不是直接接伤害,而是接攻击段,攻击段下有削减韧性,有能量恢复,有伤害