import 库

class 选择器最终处理():
    名称="选择器最终处理"
    优先=-100

    def 主要(本钩子,游戏,元行动):
        if 元行动["性质"]!="选择器":return
        if len(元行动["可选项"])==0:return
        if 元行动["终选项"]==-1:raise Exception("未选择选项")
        if 元行动["可选项"][元行动["终选项"]]["阻塞式"] and 元行动["阻塞式"]:
            元行动["当前行动体"]["剩余路程"]=10000
            游戏["纵向行动条"].append(元行动["当前行动体"])
        if not 元行动["可选项"][元行动["终选项"]]["阻塞式"]:
            游戏["横向行动条"].append({"性质":"选择器","身份":库.生成身份(),"所有者":元行动["当前行动体"]["身份"],"所属":元行动["回合结束身份"],"阻塞式":元行动["阻塞式"],"可选项":[],"终选项":-1,"当前行动体":元行动["当前行动体"]})
        
        元行动["可选项"][元行动["终选项"]]["操作"](游戏,元行动)

列表=[选择器最终处理,]