import 库_重构

# 样例
游戏={

    "钩子":{
        "回合开始":[
                {
                    "所有者":"id", # 这个所有者是用来区分是否active的. id是字符串
                    "身份":...,
                    "优先":...,
                    "操作":...
                },
            ], 
        "回合结束":[],
        ...:...,
    },

    "选择器场地":{ # 有顺序的id
        "我方":[],
        "敌方":[]
    },

    "进程场地":{
        "我方":[
            {"id":...,"active":True},
        ],
        "敌方":[
            {"max":...,"active":True,"内容":[
                {"id":...,"active":True},
            ]},
        ]
    },

    "横向行动条":[
        {"性质":...,},
    ],

    "纵向行动条":[
        {"id":...,"行动值":...,},
    ],

    "身份表":{
        "id":...,
        "id2":...,
    }

}

def 初始化游戏():
    ... # 载入我方进入身份表, 进程表
    ... # 载入敌方第一波次进入身份表, 进程表
    ... # 载入系统单位
    ... # 载入系统钩子
    ... # 压入系统登场事件
    ... # 压入角色登场事件
    ... # 压入敌方登场事件

def 主循环():
    初始化游戏()
    while True:
        库_重构.更新行动条()
        ... # pop行动条
        ... # 压入横向行动条
        ... # 处理横向行动条
        ... # 将pop出来的玩意儿压回纵向行动条
        ... # 处理进程场地带来的新问题 <- 敌人进场在这里处理, 当然, 特殊的角色可直接call这个函数
        